---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.MismatchedSystemClassificationNoSystemWarning
source: html/f267fdf2-1828-53db-1bee-f615f6bf65e0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.MismatchedSystemClassificationNoSystemWarning Property

The selected fixture is assigned to a system with different classification.

## Syntax (C#)
```csharp
public static FailureDefinitionId MismatchedSystemClassificationNoSystemWarning { get; }
```